{
  "DeprecationWarning: The '__version__' attribute is deprecated and will be removed in in a future version. Use feature detection or 'importlib.metadata.version(\"marshmallow\")' instead.": 1,
  "DeprecationWarning: distutils Version classes are deprecated. Use packaging.version instead.": 2,
  "UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.": 1,
  "DeprecationWarning: Deprecated call to `pkg_resources.declare_namespace('sphinxcontrib')`.": 1,
  "DeprecationWarning: Deprecated call to `pkg_resources.declare_namespace('flask_admin.contrib')`.": 1,
  "DeprecationWarning: Deprecated call to `pkg_resources.declare_namespace('flask_admin')`.": 1,
  "PendingDeprecationWarning: Usage of model and modelview kwargs are deprecated in favor of view_class, args and kwargs.": 1,
  "SAWarning: Object of type <ObjectVersion> not in session, add operation along 'Bucket.objects' will not proceed (This warning originated from the Session 'autoflush' process, which was invoked automatically in response to a user-initiated operation. Consider using ``no_autoflush`` context manager if this warning happened while initializing objects.)": 1,
  "DeprecationWarning: No path_separator found in configuration; falling back to legacy splitting on spaces/commas for version_locations.  Consider adding path_separator=os to Alembic config.": 1,
  "UserWarning: autoincrement and existing_autoincrement only make sense for MySQL": 1,
  "SADeprecationWarning: The from_engine() method on Inspector is deprecated and will be removed in a future release.  Please use the sqlalchemy.inspect() function on an Engine or Connection in order to acquire an Inspector. (deprecated since: 1.4)": 1,
  "UserWarning: This streaming does not support multiple storage backends.": 1,
  "FutureWarning: CSRF validation will be enabled by default in the version 1.3.x": 1
}